Autodesk.Revit.DB.Events.PreDocEventArgs.Document
The document associated with the event.

Autodesk.Revit.DB.Events.PreDocEventArgs
The class is used as base class for the arguments of any pre-event arguments that is associated to a particular Document.